{
  "terms_of_use": "شروط الاستخدام",
  "must_agree_terms_before_proceeding": "يجب عليك الموافقة على شروط الاستخدام قبل المتابعة",
  "okay": "حسناً",
  "email": "البريد الإلكتروني",
  "password": "كلمة المرور",
  "please_enter_email": "الرجاء ادخال البريد الإلكتروني",
  "please_enter_password": "الرجاء ادخال كلمة المرور",
  "forgot_password": "هل نسيت كلمة المرور؟",
  "agree_to_terms_of_use": "اوافق على شروط الاستخدام",
  "sign_in": "تسجيل الدخول",
   "home1" : "الرئيسية",
   "showmore" : "اكثر",
"showless" : "اقل " ,
"news" :"اخر الاخبار",
"comment" : "كتابة تعليق",
"design" : "تصميم وتنفيذ ذراع روبوتي متحرك متصل بمركبة ذات أربع عجلات يتم التحكم فيها عبر البلوتوث. مشروع تخرج مقدم إلى قسم هندسة تقنيات الحاسوب كجزء من متطلبات الحصول على درجة البكالوريوس في هندسة تقنيات الحاسوب بواسطة علاء حسن ضمد" ,
"mobile" :"للروبوتات المتحركة تاريخ طويل يعود إلى أوائل القرن العشرين. يُعتبر الروبوت المتحرك الأول عمومًا \"إلمر وإلسي وهما زوج من الروبوتات تم تطويرهما في معهد ماساتشوستس للتكنولوجيا (MIT) في الخمسينيات. كانت هذه الروبوتات قادرة على التنقل في الغرفة باستخدام أجهزة استشعار، وكانت قادرة على تنفيذ مهام بسيطة مثل تجنب العقبات واتباع الخطوط. في الستينيات والسبعينيات، بدأت الروبوتات المتحركة تُستخدم في التصنيع والبيئات الصناعية الأخرى، حيث استُخدمت لمهام مثل اللحام والطلاء ومعالجة المواد. كانت هذه الروبوتات الصناعية المبكرة غالبًا كبيرة الحجم ومكلفة وتتطلب تدريبًا متخصصًا للتشغيل. في الثمانينيات والتسعينيات، أصبحت الروبوتات المتحركة أكثر شيوعًا في البحث والإعدادات العسكرية. على سبيل المثال، تم تصميم العربات المريخية، التي طورتها وكالة ناسا ومختبر الدفع النفاث (JPL)، لاستكشاف سطح المريخ وجمع البيانات العلمية. في المجال العسكري، تم استخدام الروبوتات المتحركة لمهام مثل تفكيك القنابل والاستطلاع. في القرن الحادي والعشرين، أصبحت الروبوتات المتحركة أكثر انتشارًا وتُستخدم في مجموعة متنوعة من المجالات، بما في ذلك التصنيع والرعاية الصحية والزراعة وتجارة التجزئة. تتنوع أحجامها وتُستخدم لمهام مثل التفتيش والنقل والمراقبة. يتم تجهيز العديد من الروبوتات المتحركة الحديثة بأجهزة استشعار متقدمة وذكاء صناعي، مما يمكنها من التنقل وأداء المهام بشكل مستقل.",
"it_is_one" : "يُعد أحد الأدوات المستخدمة في صناعة الذراع الروبوتي المتحرك. Arduino Uno هو لوحة تحكم تعتمد على متحكم ATmega328. يحتوي على 14 منفذ إدخال/إخراج رقمي، و6 مدخلات تناظرية، ومذبذب كريستالي بتردد 16 ميجاهرتز، واتصال USB، ومقبس طاقة، ورأس ICSP، وزر إعادة تشغيل. يتم برمجته باستخدام لغة برمجة Arduino وبيئة التطوير المتكاملة Arduino (IDE). Arduino Uno هو خيار شائع للمبتدئين لتعلم برمجة المتحكمات والإلكترونيات. كما يُستخدم على نطاق واسع في مشاريع الإلكترونيات الشخصية ومنصة للنماذج الأولية لتطبيقات مختلفة.",
"copy" : "نسخ",
"share" : "مشاركة" ,
"pin" : "تثبيت",
"cancel" : "الغاء",
"comments" : "التعليقات",
"like" :"اعجبني",
"reply" : "رد",
"wac" : "اكتب تعليقاً...",
"min" :"13 د",
"view_pdf" : "Pdf",
"logincode" : "تسجيل الدخول بأستخدام الكود؟",
"entercode" : "ادخل الكود",
"download_pdf": "تحميل PDF...",
  "pdf_loaded": "تم التحميل. اضغط لعرض الـ PDF",
  "wait_pdf_loading": "انتظر تحميل الـ PDF...",
  "forgotpassword" : " هل نسيت كلمة المرور?",
  "sendtotheemail" : "ارسال الى البريد الاكتروني",
   "delete_file" : "حذف الملف",
  "open_file" : "فتح الملف",
  "options" : "خيارات",
  "post_title" : "عنوان المنشور",
   "timer" : "20 س",
    "please_wait" : "من فضلك انتظر",
    "cours_title" : "عنوان المحاضرة",
    "cours_num" : "33 فيديو",
    "courses" : "دروس",
    "my_coureses" :"دروسي",
    "account" : "الحساب",
  "favorites" : "المفضلة",
  "search" : "بحث",
  "no_results_found" :"لا توجد نتائج",
  "settings": "الاعدادات",
  "m_profile" : " ملفي الشخصي",
  "lang" : "اللغة" ,
  "darkmode" : "الوضع الداكن" ,
  "about" : "حول" ,
  "report" : "ابلاغ",
  "sinout" : "تسجيل خروج",
  "imag_download" : "نجح تنزيل الصورة",
  "next" : "التالي",
  "previous" : "السابق",
  "description" : "الوصف",
  "please_answer_all_questions_completely" : "يرجى الإجابة على جميع الأسئلة كاملة!",
  "correct_answer" : "شرح السوال",
  "please_select_the_required_number_of_answers" : "الرجاء اختيار عدد الاجابات المطلوبة.",
  "your_score" : "نتيجتك",
  "view_results" : "عرض النتيجة"
}